qemu/qemu/hw/arm/stm32_rcc.c
/*
 * STM32 Microcontroller RCC (Reset and Clock Control) module
 *
 * Copyright (C) 2010 Andre Beckus
 *
 * Source code based on omap_clk.c
 * Implementation based on ST Microelectronics "RM0008 Reference Manual Rev 10"
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License as
 * published by the Free Software Foundation; either version 2 of
 * the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along
 * with this program; if not, see <http://www.gnu.org/licenses/>.
 */

#include "hw/arm/stm32.h"
#include "hw/arm/stm32_clktree.h"
#include "qemu/bitops.h"
#include <stdio.h>


/* DEFINITIONS*/

/* See README for DEBUG details. */
#define DEBUG_STM32_RCC

#ifdef DEBUG_STM32_RCC
#define DPRINTF(fmt, ...)                                       \
    do { printf("STM32_RCC: " fmt , ## __VA_ARGS__); } while (0)
#else
#define DPRINTF(fmt, ...)
#endif

#define HSI_FREQ 8000000
#define LSI_FREQ 40000

#define RCC_CR_OFFSET 0x00
#define RCC_CR_PLL3RDY_CL_BIT   29
#define RCC_CR_PLL3ON_CL_BIT    28
#define RCC_CR_PLL2RDY_CL_BIT   27
#define RCC_CR_PLL2ON_CL_BIT    26
#define RCC_CR_PLLRDY_BIT       25
#define RCC_CR_PLLON_BIT        24
#define RCC_CR_CSSON_BIT        19
#define RCC_CR_HSEBYP_BIT       18
#define RCC_CR_HSERDY_BIT       17
#define RCC_CR_HSEON_BIT        16
#define RCC_CR_HSICAL_START     8
#define RCC_CR_HSICAL_MASK      0x0000ff00
#define RCC_CR_HSITRIM_START    3
#define RCC_CR_HSITRIM_MASK     0x000000f8
#define RCC_CR_HSIRDY_BIT       1
#define RCC_CR_HSION_BIT        0

#define RCC_CFGR_OFFSET 0x04
#define RCC_CFGR_MCO_START       24
#define RCC_CFGR_MCO_MASK        0x07000000
#define RCC_CFGR_MCO_CL_MASK     0x0f000000
#define RCC_CFGR_USBPRE_BIT      22
#define RCC_CFGR_OTGFSPRE_CL_BIT 22
#define RCC_CFGR_PLLMUL_START    18
#define RCC_CFGR_PLLMUL_LENGTH   4
#define RCC_CFGR_PLLXTPRE_BIT    17
#define RCC_CFGR_PLLSRC_BIT      16
#define RCC_CFGR_ADCPRE_START    14
#define RCC_CFGR_ADCPRE_MASK     0x0000c000
#define RCC_CFGR_PPRE2_START     11
#define RCC_CFGR_PPRE2_MASK      0x00003c00
#define RCC_CFGR_PPRE1_START     8
#define RCC_CFGR_PPRE1_MASK      0x00000700
#define RCC_CFGR_HPRE_START      4
#define RCC_CFGR_HPRE_MASK       0x000000f0
#define RCC_CFGR_SWS_START       2
#define RCC_CFGR_SWS_MASK        0x0000000c
#define RCC_CFGR_SW_START        0
#define RCC_CFGR_SW_MASK         0x00000003

#define RCC_CIR_OFFSET 0x08

#define RCC_APB2RSTR_OFFSET 0x0c

#define RCC_APB1RSTR_OFFSET 0x10

#define RCC_AHBENR_OFFSET 0x14

#define RCC_APB2ENR_OFFSET 0x18
#define RCC_APB2ENR_ADC3EN_BIT   15
#define RCC_APB2ENR_USART1EN_BIT 14
#define RCC_APB2ENR_TIM8EN_BIT   13
#define RCC_APB2ENR_SPI1EN_BIT   12
#define RCC_APB2ENR_TIM1EN_BIT   11
#define RCC_APB2ENR_ADC2EN_BIT   10
#define RCC_APB2ENR_ADC1EN_BIT   9
#define RCC_APB2ENR_IOPGEN_BIT   8
#define RCC_APB2ENR_IOPFEN_BIT   7
#define RCC_APB2ENR_IOPEEN_BIT   6
#define RCC_APB2ENR_IOPDEN_BIT   5
#define RCC_APB2ENR_IOPCEN_BIT   4
#define RCC_APB2ENR_IOPBEN_BIT   3
#define RCC_APB2ENR_IOPAEN_BIT   2
#define RCC_APB2ENR_AFIOEN_BIT   0

#define RCC_APB1ENR_OFFSET 0x1c
#define RCC_APB1ENR_DACEN_BIT    29
#define RCC_APB1ENR_PWREN_BIT    28
#define RCC_APB1ENR_BKPEN_BIT    27
#define RCC_APB1ENR_CAN2EN_BIT   26
#define RCC_APB1ENR_CAN1EN_BIT   25
#define RCC_APB1ENR_CANEN_BIT    25
#define RCC_APB1ENR_USBEN_BIT    23
#define RCC_APB1ENR_I2C2EN_BIT   22
#define RCC_APB1ENR_I2C1EN_BIT   21
#define RCC_APB1ENR_USART5EN_BIT 20
#define RCC_APB1ENR_USART4EN_BIT 19
#define RCC_APB1ENR_USART3EN_BIT 18
#define RCC_APB1ENR_USART2EN_BIT 17
#define RCC_APB1ENR_SPI3EN_BIT   15
#define RCC_APB1ENR_SPI2EN_BIT   14
#define RCC_APB1ENR_WWDGEN_BIT   11
#define RCC_APB1ENR_TIM7EN_BIT   5
#define RCC_APB1ENR_TIM6EN_BIT   4
#define RCC_APB1ENR_TIM5EN_BIT   3
#define RCC_APB1ENR_TIM4EN_BIT   2
#define RCC_APB1ENR_TIM3EN_BIT   1
#define RCC_APB1ENR_TIM2EN_BIT   0

#define RCC_BDCR_OFFSET 0x20
#define RCC_BDCR_RTCEN_BIT 15
#define RCC_BDCR_RTCSEL_START 8
#define RCC_BDCR_RTCSEL_MASK 0x00000300
#define RCC_BDCR_LSERDY_BIT 1
#define RCC_BDCR_LSEON_BIT 0

#define RCC_CSR_OFFSET 0x24
#define RCC_CSR_LSIRDY_BIT 1
#define RCC_CSR_LSION_BIT 0

#define RCC_AHBRSTR 0x28

#define RCC_CFGR2_OFFSET 0x2c
#define RCC_CFGR2_I2S3SRC_BIT    18
#define RCC_CFGR2_I2S2SRC_BIT    17
#define RCC_CFGR2_PREDIV1SRC_BIT 16
#define RCC_CFGR2_PLL3MUL_START  12
#define RCC_CFGR2_PLL3MUL_MASK   0x0000f000
#define RCC_CFGR2_PLL2MUL_START  8
#define RCC_CFGR2_PLL2MUL_MASK   0x00000f00
#define RCC_CFGR2_PREDIV2_START  4
#define RCC_CFGR2_PREDIV2_MASK   0x000000f0
#define RCC_CFGR2_PREDIV_START   0
#define RCC_CFGR2_PREDIV_MASK    0x0000000f
#define RCC_CFGR2_PLLXTPRE_BIT   0

#define PLLSRC_HSI_SELECTED 0
#define PLLSRC_HSE_SELECTED 1

#define SW_HSI_SELECTED 0
#define SW_HSE_SELECTED 1
#define SW_PLL_SELECTED 2

struct Stm32Rcc {
    /* Inherited */
    SysBusDevice busdev;

    /* Properties */
    uint32_t osc_freq;
    uint32_t osc32_freq;

    /* Private */
    MemoryRegion iomem;

    /* Register Values */
    uint32_t
        RCC_APB1ENR,
        RCC_APB2ENR;

    /* Register Field Values */
    uint32_t
        RCC_CFGR_PLLMUL,
        RCC_CFGR_PLLXTPRE,
        RCC_CFGR_PLLSRC,
        RCC_CFGR_PPRE1,
        RCC_CFGR_PPRE2,
        RCC_CFGR_HPRE,
        RCC_CFGR_SW;

    Stm32Clk
        HSICLK,
        HSECLK,
        LSECLK,
        LSICLK,
        SYSCLK,
        PLLXTPRECLK,
        PLLCLK,
        HCLK, /* Output from AHB Prescaler */
        PCLK1, /* Output from APB1 Prescaler */
        PCLK2, /* Output from APB2 Prescaler */
        PERIPHCLK[STM32_PERIPH_COUNT];

    qemu_irq irq;
};



/* HELPER FUNCTIONS */

/* Enable the peripheral clock if the specified bit is set in the value. */
static void stm32_rcc_periph_enable(
                    Stm32Rcc *s,
                    uint32_t new_value,
                    bool init,
                    int periph,
                    uint32_t bit_pos)
{
    stm32_clktree_set_enabled(s->PERIPHCLK[periph], new_value & BIT(bit_pos));
}





/* REGISTER IMPLEMENTATION */

/* Read the configuration register. */
static uint32_t stm32_rcc_RCC_CR_read(Stm32Rcc *s)
{
    /* Get the status of the clocks. */
    int pllon_bit = stm32_clktree_is_enabled(s->PLLCLK) ? 1 : 0;
    int hseon_bit = stm32_clktree_is_enabled(s->HSECLK) ? 1 : 0;
    int hsion_bit = stm32_clktree_is_enabled(s->HSICLK) ? 1 : 0;

