qemu/qemu/hw/arm/stm32_rcc.c
    /* build the register value based on the clock states.  If a clock is on,
     * then its ready bit is always set.
     */
    return pllon_bit << RCC_CR_PLLRDY_BIT |
           pllon_bit << RCC_CR_PLLON_BIT |
           hseon_bit << RCC_CR_HSERDY_BIT |
           hseon_bit << RCC_CR_HSEON_BIT |
           hsion_bit << RCC_CR_HSIRDY_BIT |
           hsion_bit << RCC_CR_HSION_BIT;
}

/* Write the Configuration Register.
 * This updates the states of the corresponding clocks.  The bit values are not
 * saved - when the register is read, its value will be built using the clock
 * states.
 */
static void stm32_rcc_RCC_CR_write(Stm32Rcc *s, uint32_t new_value, bool init)
{
    bool new_pllon, new_hseon, new_hsion;

    new_pllon = new_value & BIT(RCC_CR_PLLON_BIT);
    if((stm32_clktree_is_enabled(s->PLLCLK) && !new_pllon) &&
       s->RCC_CFGR_SW == SW_PLL_SELECTED) {
        stm32_hw_warn("PLL cannot be disabled while it is selected as the system clock.");
    }
    stm32_clktree_set_enabled(s->PLLCLK, new_pllon);

    new_hseon = new_value & BIT(RCC_CR_HSEON_BIT);
    if((stm32_clktree_is_enabled(s->HSECLK) && !new_hseon) &&
       (s->RCC_CFGR_SW == SW_HSE_SELECTED ||
        (s->RCC_CFGR_SW == SW_PLL_SELECTED && s->RCC_CFGR_PLLSRC == PLLSRC_HSE_SELECTED)
       )
      ) {
        stm32_hw_warn("HSE oscillator cannot be disabled while it is driving the system clock.");
    }
    stm32_clktree_set_enabled(s->HSECLK, new_hseon);

    new_hsion = new_value & BIT(RCC_CR_HSION_BIT);
    if((stm32_clktree_is_enabled(s->HSECLK) && !new_hseon) &&
       (s->RCC_CFGR_SW == SW_HSI_SELECTED ||
        (s->RCC_CFGR_SW == SW_PLL_SELECTED && s->RCC_CFGR_PLLSRC == PLLSRC_HSI_SELECTED)
       )
      ) {
        stm32_hw_warn("HSI oscillator cannot be disabled while it is driving the system clock.");
    }
    stm32_clktree_set_enabled(s->HSICLK, new_hsion);
}


static uint32_t stm32_rcc_RCC_CFGR_read(Stm32Rcc *s)
{
    return (s->RCC_CFGR_PLLMUL << RCC_CFGR_PLLMUL_START) |
           (s->RCC_CFGR_PLLXTPRE << RCC_CFGR_PLLXTPRE_BIT) |
           (s->RCC_CFGR_PLLSRC << RCC_CFGR_PLLSRC_BIT) |
           (s->RCC_CFGR_PPRE2 << RCC_CFGR_PPRE2_START) |
           (s->RCC_CFGR_PPRE1 << RCC_CFGR_PPRE1_START) |
           (s->RCC_CFGR_HPRE << RCC_CFGR_HPRE_START) |
           (s->RCC_CFGR_SW << RCC_CFGR_SW_START) |
           (s->RCC_CFGR_SW << RCC_CFGR_SWS_START);
}


static void stm32_rcc_RCC_CFGR_write(Stm32Rcc *s, uint32_t new_value, bool init)
{
    uint32_t new_PLLMUL, new_PLLXTPRE, new_PLLSRC;

    /* PLLMUL */
    new_PLLMUL = extract32(new_value,
                           RCC_CFGR_PLLMUL_START,
                           RCC_CFGR_PLLMUL_LENGTH);
    if(!init) {
          if(stm32_clktree_is_enabled(s->PLLCLK) &&
           (new_PLLMUL != s->RCC_CFGR_PLLMUL)) {
               stm32_hw_warn("Can only change PLLMUL while PLL is disabled");
          }
    }
    assert(new_PLLMUL <= 0xf);
    if(new_PLLMUL == 0xf) {
        stm32_clktree_set_scale(s->PLLCLK, 16, 1);
    } else {
        stm32_clktree_set_scale(s->PLLCLK, new_PLLMUL + 2, 1);
    }
    s->RCC_CFGR_PLLMUL = new_PLLMUL;

    /* PLLXTPRE */
    new_PLLXTPRE = extract32(new_value, RCC_CFGR_PLLXTPRE_BIT, 1);
    if(!init) {
        if(stm32_clktree_is_enabled(s->PLLCLK) &&
           (new_PLLXTPRE != s->RCC_CFGR_PLLXTPRE)) {
            stm32_hw_warn("Can only change PLLXTPRE while PLL is disabled");
        }
    }
    stm32_clktree_set_selected_input(s->PLLXTPRECLK, new_PLLXTPRE);
    s->RCC_CFGR_PLLXTPRE = new_PLLXTPRE;

    /* PLLSRC */
    new_PLLSRC = extract32(new_value, RCC_CFGR_PLLSRC_BIT, 1);
    if(!init) {
        if(stm32_clktree_is_enabled(s->PLLCLK) &&
           (new_PLLSRC != s->RCC_CFGR_PLLSRC)) {
            stm32_hw_warn("Can only change PLLSRC while PLL is disabled");
        }
    }
    stm32_clktree_set_selected_input(s->PLLCLK, new_PLLSRC);
    s->RCC_CFGR_PLLSRC = new_PLLSRC;

    /* PPRE2 */
    s->RCC_CFGR_PPRE2 = (new_value & RCC_CFGR_PPRE2_MASK) >> RCC_CFGR_PPRE2_START;
    if(s->RCC_CFGR_PPRE2 < 0x4) {
        stm32_clktree_set_scale(s->PCLK2, 1, 1);
    } else {
        stm32_clktree_set_scale(s->PCLK2, 1, 2 * (s->RCC_CFGR_PPRE2 - 3));
    }

    /* PPRE1 */
    s->RCC_CFGR_PPRE1 = (new_value & RCC_CFGR_PPRE1_MASK) >> RCC_CFGR_PPRE1_START;
    if(s->RCC_CFGR_PPRE1 < 4) {
        stm32_clktree_set_scale(s->PCLK1, 1, 1);
    } else {
        stm32_clktree_set_scale(s->PCLK1, 1, 2 * (s->RCC_CFGR_PPRE1 - 3));
    }

    /* HPRE */
    s->RCC_CFGR_HPRE = (new_value & RCC_CFGR_HPRE_MASK) >> RCC_CFGR_HPRE_START;
    if(s->RCC_CFGR_HPRE < 8) {
        stm32_clktree_set_scale(s->HCLK, 1, 1);
    } else {
        stm32_clktree_set_scale(s->HCLK, 1, 2 * (s->RCC_CFGR_HPRE - 7));
    }

    /* SW */
    s->RCC_CFGR_SW = (new_value & RCC_CFGR_SW_MASK) >> RCC_CFGR_SW_START;
    switch(s->RCC_CFGR_SW) {
        case 0x0:
        case 0x1:
        case 0x2:
            stm32_clktree_set_selected_input(s->SYSCLK, s->RCC_CFGR_SW);
            break;
        default:
            hw_error("Invalid input selected for SYSCLK");
            break;
    }
}

/* Write the APB2 peripheral clock enable register
 * Enables/Disables the peripheral clocks based on each bit. */
static void stm32_rcc_RCC_APB2ENR_write(Stm32Rcc *s, uint32_t new_value,
                                        bool init)
{
    stm32_rcc_periph_enable(s, new_value, init, STM32_UART1,
                            RCC_APB2ENR_USART1EN_BIT);
    stm32_rcc_periph_enable(s, new_value, init, STM32_GPIOE,
                            RCC_APB2ENR_IOPEEN_BIT);
    stm32_rcc_periph_enable(s, new_value, init, STM32_GPIOD,
                            RCC_APB2ENR_IOPDEN_BIT);
    stm32_rcc_periph_enable(s, new_value, init, STM32_GPIOC,
                            RCC_APB2ENR_IOPCEN_BIT);
    stm32_rcc_periph_enable(s, new_value, init, STM32_GPIOB,
                            RCC_APB2ENR_IOPBEN_BIT);
    stm32_rcc_periph_enable(s, new_value, init, STM32_GPIOA,
                            RCC_APB2ENR_IOPAEN_BIT);
    stm32_rcc_periph_enable(s, new_value, init, STM32_AFIO_PERIPH,
                            RCC_APB2ENR_AFIOEN_BIT);
    stm32_rcc_periph_enable(s, new_value, init, STM32_GPIOG,
                            RCC_APB2ENR_IOPGEN_BIT);
    stm32_rcc_periph_enable(s, new_value, init, STM32_GPIOF,
                            RCC_APB2ENR_IOPFEN_BIT);

    stm32_rcc_periph_enable(s, new_value, init, STM32_TIM1,
                            RCC_APB2ENR_TIM1EN_BIT);
    stm32_rcc_periph_enable(s, new_value, init, STM32_TIM8,
                            RCC_APB2ENR_TIM8EN_BIT);

    s->RCC_APB2ENR = new_value & 0x0000fffd;
}

/* Write the APB1 peripheral clock enable register
 * Enables/Disables the peripheral clocks based on each bit. */
static void stm32_rcc_RCC_APB1ENR_write(Stm32Rcc *s, uint32_t new_value,
                    bool init)
{
    stm32_rcc_periph_enable(s, new_value, init, STM32_UART5,
                            RCC_APB1ENR_USART5EN_BIT);
    stm32_rcc_periph_enable(s, new_value, init, STM32_UART4,
                            RCC_APB1ENR_USART4EN_BIT);
    stm32_rcc_periph_enable(s, new_value, init, STM32_UART3,
                            RCC_APB1ENR_USART3EN_BIT);
    stm32_rcc_periph_enable(s, new_value, init, STM32_UART2,
                            RCC_APB1ENR_USART2EN_BIT);

    stm32_rcc_periph_enable(s, new_value, init, STM32_TIM2,
                            RCC_APB1ENR_TIM2EN_BIT);
    stm32_rcc_periph_enable(s, new_value, init, STM32_TIM3,
                            RCC_APB1ENR_TIM3EN_BIT);
    stm32_rcc_periph_enable(s, new_value, init, STM32_TIM4,
                            RCC_APB1ENR_TIM4EN_BIT);
    stm32_rcc_periph_enable(s, new_value, init, STM32_TIM5,
                            RCC_APB1ENR_TIM5EN_BIT);
    stm32_rcc_periph_enable(s, new_value, init, STM32_TIM6,
                            RCC_APB1ENR_TIM6EN_BIT);
    stm32_rcc_periph_enable(s, new_value, init, STM32_TIM7,
                            RCC_APB1ENR_TIM7EN_BIT);

    s->RCC_APB1ENR = new_value & 0x00005e7d;
}

static uint32_t stm32_rcc_RCC_BDCR_read(Stm32Rcc *s)
{
    int lseon_bit = stm32_clktree_is_enabled(s->LSECLK) ? 1 : 0;

    return lseon_bit << RCC_BDCR_LSERDY_BIT |
           lseon_bit << RCC_BDCR_LSEON_BIT;
}

static void stm32_rcc_RCC_BDCR_write(Stm32Rcc *s, uint32_t new_value, bool init)
{
    stm32_clktree_set_enabled(s->LSECLK, new_value & BIT(RCC_BDCR_LSEON_BIT));
}

/* Works the same way as stm32_rcc_RCC_CR_read */
static uint32_t stm32_rcc_RCC_CSR_read(Stm32Rcc *s)
{
    int lseon_bit = stm32_clktree_is_enabled(s->LSICLK) ? 1 : 0;

    return lseon_bit << RCC_CSR_LSIRDY_BIT |
           lseon_bit << RCC_CSR_LSION_BIT;
}

