qemu/qemu/hw/arm/stm32_rcc.c
/* Works the same way as stm32_rcc_RCC_CR_write */
static void stm32_rcc_RCC_CSR_write(Stm32Rcc *s, uint32_t new_value, bool init)
{
    stm32_clktree_set_enabled(s->LSICLK, new_value & BIT(RCC_CSR_LSION_BIT));
}



static uint64_t stm32_rcc_readw(void *opaque, hwaddr offset)
{
    Stm32Rcc *s = (Stm32Rcc *)opaque;

    switch (offset) {
        case RCC_CR_OFFSET:
            return stm32_rcc_RCC_CR_read(s);
        case RCC_CFGR_OFFSET:
            return stm32_rcc_RCC_CFGR_read(s);
        case RCC_CIR_OFFSET:
            return 0;
        case RCC_APB2RSTR_OFFSET:
        case RCC_APB1RSTR_OFFSET:
        case RCC_AHBENR_OFFSET:
            STM32_NOT_IMPL_REG(offset, 4);
            return 0;
        case RCC_APB2ENR_OFFSET:
            return s->RCC_APB2ENR;
        case RCC_APB1ENR_OFFSET:
            return s->RCC_APB1ENR;
        case RCC_BDCR_OFFSET:
            return stm32_rcc_RCC_BDCR_read(s);
        case RCC_CSR_OFFSET:
            return stm32_rcc_RCC_CSR_read(s);
        case RCC_AHBRSTR:
            STM32_NOT_IMPL_REG(offset, 4);
            return 0;
        case RCC_CFGR2_OFFSET:
            STM32_NOT_IMPL_REG(offset, 4);
            return 0;
        default:
            STM32_BAD_REG(offset, 4);
            break;
    }
}


static void stm32_rcc_writew(void *opaque, hwaddr offset,
                          uint64_t value)
{
    Stm32Rcc *s = (Stm32Rcc *)opaque;

    switch(offset) {
        case RCC_CR_OFFSET:
            stm32_rcc_RCC_CR_write(s, value, false);
            break;
        case RCC_CFGR_OFFSET:
            stm32_rcc_RCC_CFGR_write(s, value, false);
            break;
        case RCC_CIR_OFFSET:
            /* Allow a write but don't take any action */
            break;
        case RCC_APB2RSTR_OFFSET:
        case RCC_APB1RSTR_OFFSET:
        case RCC_AHBENR_OFFSET:
            STM32_NOT_IMPL_REG(offset, 4);
            break;
        case RCC_APB2ENR_OFFSET:
            stm32_rcc_RCC_APB2ENR_write(s, value, false);
            break;
        case RCC_APB1ENR_OFFSET:
            stm32_rcc_RCC_APB1ENR_write(s, value, false);
            break;
        case RCC_BDCR_OFFSET:
            stm32_rcc_RCC_BDCR_write(s, value, false);
            break;
        case RCC_CSR_OFFSET:
            stm32_rcc_RCC_CSR_write(s, value, false);
            break;
        case RCC_AHBRSTR:
            STM32_NOT_IMPL_REG(offset, 4);
            break;
        case RCC_CFGR2_OFFSET:
            STM32_NOT_IMPL_REG(offset, 4);
            break;
        default:
            STM32_BAD_REG(offset, 4);
            break;
    }
}

static uint64_t stm32_rcc_read(void *opaque, hwaddr offset,
                          unsigned size)
{
    switch(size) {
        case 4:
            return stm32_rcc_readw(opaque, offset);
        default:
            STM32_NOT_IMPL_REG(offset, size);
            return 0;
    }
}

static void stm32_rcc_write(void *opaque, hwaddr offset,
                       uint64_t value, unsigned size)
{
    switch(size) {
        case 4:
            stm32_rcc_writew(opaque, offset, value);
            break;
        default:
            STM32_NOT_IMPL_REG(offset, size);
            break;
    }
}

static const MemoryRegionOps stm32_rcc_ops = {
    .read = stm32_rcc_read,
    .write = stm32_rcc_write,
    .endianness = DEVICE_NATIVE_ENDIAN
};


static void stm32_rcc_reset(DeviceState *dev)
{
    Stm32Rcc *s = FROM_SYSBUS(Stm32Rcc, SYS_BUS_DEVICE(dev));

    stm32_rcc_RCC_CR_write(s, 0x00000083, true);
    stm32_rcc_RCC_CFGR_write(s, 0x00000000, true);
    stm32_rcc_RCC_APB2ENR_write(s, 0x00000000, true);
    stm32_rcc_RCC_APB1ENR_write(s, 0x00000000, true);
    stm32_rcc_RCC_BDCR_write(s, 0x00000000, true);
    stm32_rcc_RCC_CSR_write(s, 0x0c000000, true);
}

/* IRQ handler to handle updates to the HCLK frequency.
 * This updates the SysTick scales. */
static void stm32_rcc_hclk_upd_irq_handler(void *opaque, int n, int level)
{
    Stm32Rcc *s = (Stm32Rcc *)opaque;

    uint32_t hclk_freq, ext_ref_freq;

    hclk_freq = stm32_clktree_get_output_freq(s->HCLK);

    /* Only update the scales if the frequency is not zero. */
    if(hclk_freq > 0) {
        ext_ref_freq = hclk_freq / 8;

        /* Update the scales - these are the ratio of QEMU clock ticks
         * (which is an unchanging number independent of the CPU frequency) to
         * system/external clock ticks.
         */
        system_clock_scale = get_ticks_per_sec() / hclk_freq;
        external_ref_clock_scale = get_ticks_per_sec() / ext_ref_freq;
    }

#ifdef DEBUG_STM32_RCC
    DPRINTF("Cortex SYSTICK frequency set to %lu Hz (scale set to %d).\n",
                (unsigned long)hclk_freq, system_clock_scale);
    DPRINTF("Cortex SYSTICK ext ref frequency set to %lu Hz "
              "(scale set to %d).\n",
              (unsigned long)ext_ref_freq, external_ref_clock_scale);
#endif
}







/* PUBLIC FUNCTIONS */

void stm32_rcc_check_periph_clk(Stm32Rcc *s, stm32_periph_t periph)
{
    Stm32Clk clk = s->PERIPHCLK[periph];

    assert(clk != NULL);

    if(!stm32_clktree_is_enabled(clk)) {
        /* I assume writing to a peripheral register while the peripheral clock
         * is disabled is a bug and give a warning to unsuspecting programmers.
         * When I made this mistake on real hardware the write had no effect.
         */
        hw_error("Warning: You are attempting to use the %s peripheral while "
                 "its clock is disabled.\n", stm32_periph_name(periph));
    }
}

void stm32_rcc_set_periph_clk_irq(
        Stm32Rcc *s,
        stm32_periph_t periph,
        qemu_irq periph_irq)
{
    Stm32Clk clk = s->PERIPHCLK[periph];

    assert(clk != NULL);

    stm32_clktree_adduser(clk, periph_irq);
}

uint32_t stm32_rcc_get_periph_freq(
        Stm32Rcc *s,
        stm32_periph_t periph)
{
    Stm32Clk clk;

    clk = s->PERIPHCLK[periph];

    assert(clk != NULL);

    return stm32_clktree_get_output_freq(clk);
}









/* DEVICE INITIALIZATION */

/* Set up the clock tree */
static void stm32_rcc_init_clk(Stm32Rcc *s)
{
    int i;
    qemu_irq *hclk_upd_irq =
            qemu_allocate_irqs(stm32_rcc_hclk_upd_irq_handler, s, 1);
    Stm32Clk HSI_DIV2, HSE_DIV2;

    /* Make sure all the peripheral clocks are null initially.
     * This will be used for error checking to make sure
     * an invalid clock is not referenced (not all of the
     * indexes will be used).
     */
    for(i = 0; i < STM32_PERIPH_COUNT; i++) {
        s->PERIPHCLK[i] = NULL;
    }

    /* Initialize clocks */
    /* Source clocks are initially disabled, which represents
     * a disabled oscillator.  Enabling the clock represents
     * turning the clock on.
     */
    s->HSICLK = stm32_clktree_create_src_clk("HSI", HSI_FREQ, false);
    s->LSICLK = stm32_clktree_create_src_clk("LSI", LSI_FREQ, false);
    s->HSECLK = stm32_clktree_create_src_clk("HSE", s->osc_freq, false);
    s->LSECLK = stm32_clktree_create_src_clk("LSE", s->osc32_freq, false);

    HSI_DIV2 = stm32_clktree_create_clk("HSI/2", 1, 2, true, CLKTREE_NO_MAX_FREQ, 0,
                        s->HSICLK, NULL);
    HSE_DIV2 = stm32_clktree_create_clk("HSE/2", 1, 2, true, CLKTREE_NO_MAX_FREQ, 0,
                        s->HSECLK, NULL);

    s->PLLXTPRECLK = stm32_clktree_create_clk("PLLXTPRE", 1, 1, true, CLKTREE_NO_MAX_FREQ, CLKTREE_NO_INPUT,
                        s->HSECLK, HSE_DIV2, NULL);
    /* PLLCLK contains both the switch and the multiplier, which are shown as
     * two separate components in the clock tree diagram.
     */
    s->PLLCLK = stm32_clktree_create_clk("PLLCLK", 0, 1, false, 72000000, CLKTREE_NO_INPUT,
                        HSI_DIV2, s->PLLXTPRECLK, NULL);

